nozzleFlow2_plastoFoam/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases (fuel air);

fuel
{
    transportModel  CrossPowerLaw2;

    nu              [0 2 -1 0 0 0 0] 5.952e-06;
    rho             [1 -3 0 0 0 0 0] 850;
    k		    [1 1 -3 -1 0 0 0] 1;
    Cv		    [0 2 -2 -1 0 0 0] 1;

CrossPowerLaw2Coeffs
{
 
      
    nu0         [0 2 -1 0 0 0 0]  0.01;
    m           [0 0 1 0 0 0 0]   0.4;
    n           [0 0 0 0 0 0 0]   3;
    Tau         [0 2 -1 0 0 0 0]   2;
    D1          [0 2 -1 0 0 0 0]   3;
    Tzv         [0 0 0 1 0 0 0]   1;
    A1          [0 0 0 0 0 0 0]   1;
    A2           [0 0 0 1 0 0 0]   3;
    

}

}

air
{
    transportModel  Newtonian;
    nu              [0 2 -1 0 0 0 0] 1.48e-05;
    rho             [1 -3 0 0 0 0 0] 1;
    k		    [1 1 -3 -1 0 0 0] 1;
    Cv		    [0 2 -2 -1 0 0 0] 1;
}

sigma           [1 0 -2 0 0 0 0] 0.07;


// ************************************************************************* //
